module.exports = {
  config: {
    name: "زخرف",
    version: "1.0",
    author: "Y",
    category: "services",
    countDown: 5,
    role: 0,
  },

  onStart: async function ({ api, args, message }) {
    // قائمة بالحروف المراد تحويلها
    const replaceChars = {
      "a": "𝒶",
      "b": "𝒷",
      "c": "𝒸",
      "d": "𝒹",
      "e": "𝑒",
      "f": "𝒻",
      "g": "𝑔",
      "h": "𝒽",
      "i": "𝒾",
      "j": "𝒿",
      "k": "𝓀",
      "l": "𝓁",
      "m": "𝓂",
      "n": "𝓃",
      "o": "𝑜",
      "p": "𝓅",
      "q": "𝓆",
      "r": "𝓇",
      "s": "𝓈",
      "t": "𝓉",
      "u": "𝓊",
      "v": "𝓋",
      "w": "𝓌",
      "x": "𝓍",
      "y": "𝓎",
      "z": "𝓏",
      "A": "𝒜",
      "B": "𝐵",
      "C": "𝒞",
      "D": "𝒟",
      "E": "𝐸",
      "F": "𝐹",
      "G": "𝒢",
      "H": "𝐻",
      "I": "𝐼",
      "J": "𝒥",
      "K": "𝒦",
      "L": "𝐿",
      "M": "𝑀",
      "N": "𝒩",
      "O": "𝒪",
      "P": "𝒫",
      "Q": "𝒬",
      "R": "𝑅",
      "S": "𝒮",
      "T": "𝒯",
      "U": "𝒰",
      "V": "𝒱",
      "W": "𝒲",
      "X": "𝒳",
      "Y": "𝒴",
      "Z": "𝒵"
    };

    // النص الذي سيتم تحويله
    const inputText = args.join("");

    let result = "";

    // محول النص
    for (let i = 0; i < inputText.length; i++) {
      const char = inputText[i];
      result += replaceChars[char] || char;
    }

    // إرسال النتيجة
    message.send(result);
  },
};